app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
---
  def products
    @category = Category.find(params[:id])

INSERT INTO "categories" ("image_file_size", "updated_at", "title", "image_content_type", "description", "image_updated_at", "created_at", "image_file_name") VALUES(38995, '2010-06-10 20:42:55', 'Motores', 'image/jpeg', 'Lorem ipsum is simply dummy text of te printing and typesetting industry. Lorem ipsum has been the intrustry''s standard dummy text ever since the 1500s, when an unknown printer tool a gallery of type and scrambled in to make a type specimen book.', '2010-06-10 20:42:52', '2010-06-10 20:42:55', 'categoria.jpg')
---
  def create

    respond_to do |format|
      if @category.save

UPDATE "categories" SET "updated_at" = '2010-06-11 06:34:08', "description" = 'Lorem ipsum is simply dummy text of te printing and typesetting industry. Lorem ipsum has been the intrustry''s standard dummy text ever since the 1500s, when an unknown printer tool a gallery of type and scrambled in to make a type specimen book.' WHERE "id" = 5
---
  def update

    respond_to do |format|
      if @category.update_attributes(params[:category])

DELETE FROM "categories" WHERE "id" = 1
---
  def destroy
    @category.destroy