app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1) AND ((used ='t') AND ("products".category_id = 1))
---
  def used_products
  @products = Category.find(params[:category_id]).products.used?(true)

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1) AND ((used ='f') AND ("products".category_id = 1))
---
  def new_products
  @products = Category.find(params[:category_id]).products.used?(false)

INSERT INTO "products" ("model", "created_at", "title", "dimensions", "pediment_num", "delivery_time", "updated_at", "weight", "used", "special_price", "category_id", "used_categories", "mark", "serie_num", "description", "observations", "warranty", "list_price", "sale_price") VALUES('', '2010-07-09 06:45:49', 'Producto X1', '', '', '', '2010-07-09 06:45:49', '', 't', '', 1, 'seminuevo', '', '', 'We’re all pretty much stuck with delivering HTML code from our web sites, but that doesn’t mean we have to write in it. There’s any number of markup approaches that are superior to HTML when it comes to content creation, and which can be used as source code from which to create HTML. Two that are widely used are Textile and Markdown.', '', '', '', '')
---
  def create

    respond_to do |format|
      if @product.save

UPDATE "products" SET "updated_at" = '2010-06-11 07:10:03', "description" = 'Lorem ipsum is simply dummy text of te printing and typesetting industry. Lorem ipsum has been the intrustry''s standard dummy text ever since the 1500s, when an unknown printer tool a gallery of type and scrambled in to make a type specimen book.' WHERE "id" = 1
---
  def update

    respond_to do |format|
      if @product.update_attributes(params[:product])

DELETE FROM "products" WHERE "id" = 4
---
  def destroy
    @product.destroy