app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "crypted_password", "username", "password_salt", "role", "persistence_token", "email", "created_at") VALUES('2010-06-10 22:37:37', '1d2f77e694f158b9a2cd6b45d84ce578260853ca00825fb968041293a2028affc5c50b69527e6eabdc47ebd677e655f97ad963de792f5484acf973f04596bbb5', 'stan', 'OMi6TeFK1w-MiGltpwcd', 'admin', 'a16653665f0f8069e386ba0988cac15a28e797673b4fd153ba0fdb6b3b67b291dc05f59415a92ad6b96a2e60a107f0d7a2e891b4c93c87d12f3be9da8eb22db5', 'stan@stanmx.com', '2010-06-10 22:37:37')

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "email" = 'drbizarre@gmail.com', "updated_at" = '2010-06-10 23:06:38' WHERE "id" = 2